Revit 2026 API

# AdvancedWoodWoodUsePores Property

---

The property labeled "Use pores feature" from the "AdvancedWood" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string WoodUsePores { get; }
```
```vb
Public Shared ReadOnly Property WoodUsePores As String
	Get
```
```cpp
public:
static property String^ WoodUsePores {
	String^ get ();
}
```
```fsharp
static member WoodUsePores : string with get
```

#### Property Value

String

This property is of type "AssetPropertyBoolean".

#### Reference

AdvancedWood Class

Autodesk.Revit.DB.Visual Namespace